Revit 2027 API
ParameterTypeId.ViewSolarstudyIsSingledayStudyType Property
 "Single day study"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyIsSingledayStudyType { get; }
Public Shared ReadOnly Property ViewSolarstudyIsSingledayStudyType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyIsSingledayStudyType {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyIsSingledayStudyType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace